{"pages":[{"url":"pages/about.html","text":"The About Page for Archer Imagine.","tags":"pages","title":"About"},{"url":"articles/configure-github-custom-domain.html","text":"I have mentioned some of the links in references, have visited all of the below and few more, but the configuration is much simpler. The process can be broken into 2 broad steps. Configure your Github repo Configure the DNS at GoDaddy Configure your Github repo The prequsite is that we have a github pages of like this archeranimesh.github.io , if not kindly visit this link for generating one. The first thing we would like to do is to configure a CNAME in the above repo. There are two ways to do this. Local Repo Directly on Github. Local Repo Create a local file in the repo with the name CNAME. Just have one line in the file. example.com , where example.com is your domain you have bought from GoDaddy . Push the changes to Github Directly on GitHub On the repository in Github , you will see something like this. In the above Click on the Settings , Scroll down you will see something like this. Enter the domain you have purchased from GoDaddy . These are the only changes required to be done in GitHub. Configure the DNS at GoDaddy The most easiest of the all the below references is Configuring a Godaddy domain name with github pages . The real issue is all of the links shows the old UI of GoDaddy , so some things get confusing. Go to the account setting page, which mostly will like in this link . The link will look like this. Click on the + Symbols in Front of Domain, and Click on the Manage DNS Link The link will show a lot of Records , go to the end of the Records , and click on the link ADD From the above option we have to add 3 entries. These is how all the 3 would look like after adding. Now you can launch and check your desired domain. Kindly wait 48 hrs for these changes to reflect, do not try to configure multiple times, if it does not work even after 48 hours kindly search for help, till then take a coffee break and have a nice time out of this screen. The domain XYX is no longer parked by godaddy When we are doing the above process, even after 24 hours, when you launch your website, we find one of these error. The domain XYX is no longer parked by godaddy It is detected as a Malware in the office network. The website might launch for some times and sometimes you might get any one of the above 2 errors. kindly check this in the Manage DNS page. We had added two A Names pointing to the GitHub URL as shown below. Check if you have any other A Names in addition to the above two, if you have, kindly delete that. The detailed issue can be read GoDaddy domain (randomly) not resolving to GitHub Pages References Setting Up a GoDaddy Domain Name With GitHub Configuring a Godaddy domain name with github pages Using a custom domain with GitHub Pages Using GitHub Pages To Host Your Website GoDaddy domain (randomly) not resolving to GitHub Pages [Help]: How to correctly connect my github pages blog to a custom domain? Redirecting GitHub Page to a custom domain Kindly read the above site, to understand what is the use of CNAME and A Record. Great introduction.","tags":"Pelican","title":"Configuring Github pages with Custom Domain"}]}